package com.example.pizzarecipes;

public class Utils {
    public static final String PIZZA_1_TITLE = "Пицца пеперрони";
    public static final String PIZZA_1_DESCRIPTION = "Приготовьте пиццу для всей семьи с домашней основой и томатным соусом. Вегетарианский рецепт идеально подходит для того, чтобы приобщить к приготовлению детей. Сверху посыпьте моцареллой и свежим базиликом";
    public static final String PIZZA_1_RECIPE = "ШАГ 1\n" +
            "Высыпьте муку в миску, затем добавьте дрожжи и 1 ч. л. соли. Сделайте углубление в центре и влейте 200 мл теплой воды (убедитесь, что она не слишком горячая) вместе с маслом. Перемешивайте деревянной ложкой, пока не получится мягкое, достаточно влажное тесто.\n" +
            "\n" +
            "ШАГ 2\n" +
            "Выложите тесто на слегка посыпанную мукой поверхность и месите в течение 5 минут до получения однородной массы. Накройте кухонным полотенцем и отставьте примерно на час или пока тесто не вздуется и не увеличится в размере вдвое. Вы также можете оставить грубое тесто без замешивания в миске, накрыть кухонным полотенцем и оставить в холодильнике на ночь, тогда тесто будет готовиться само по себе.\n" +
            "\n" +
            "ШАГ 3\n" +
            "Тем временем приготовьте томатный соус. Налейте масло в небольшую сковороду и слегка обжарьте чеснок (не дайте ему подрумяниться), затем добавьте пассату и тушите все, пока соус немного не загустеет. Оставьте остывать.\n" +
            "\n" +
            "ШАГ 4\n" +
            "Как только тесто поднимется, быстро замесите его в миске, чтобы отбить, затем выложите на слегка посыпанную мукой поверхность и разделайте на два шарика. Раскатайте каждый шарик в большую каплю, очень тонкую, около 25 см в поперечнике (каплевидные формы легче подходят для выпечки, чем круглые).\n" +
            "\n" +
            "ШАГ 5\n" +
            "Разогрейте духовку до 240 ° C / вентилятор 220 ° C / газ 9 с большим противнем внутри. Переложите одну из основ на другой противень, посыпанный мукой. Разровняйте соус по основе тыльной стороной ложки, распределите по половинке моцареллы, сбрызните оливковым маслом и приправьте. Положите пиццу, все еще лежащую на противне, поверх горячего листа в духовке и запекайте в течение 8-10 минут до образования хрустящей корочки.";

    public static final String PIZZA_2_TITLE = "Пицца гавайская";
    public static final String PIZZA_2_DESCRIPTION = "Приготовьте наши пиццы с курицей и специями, используя хлеб наан, всего за 20 минут. Чтобы сбалансировать температуру, подавайте их с кусочками мангового чатни и натуральным йогуртом";
    public static final String PIZZA_2_RECIPE = "ШАГ 1\n" +
            "Разогрейте духовку до 180 ° С / вентилятор / газ 160С 4. Смешайте красный лук с красным винным уксусом и хорошей щепоткой соли и отложите в сторону (уксус слегка размягчит лук, что является благом, поскольку никто не хочет, чтобы пицца была с полностью сырым луком).\n" +
            "\n" +
            "ШАГ 2\n" +
            "Выложите хлебцы наан на противень, сбрызните небольшим количеством воды, затем поставьте в духовку на 2 минуты для разогрева. Тем временем выложите курицу и перец на сковороду с пастой карри, перемешайте, затем обжаривайте на сильном огне 6-8 минут до готовности.\n" +
            "\n" +
            "ШАГ 3\n" +
            "Достаньте нааны из духовки, намажьте каждую йогуртом, затем сверху выложите курицу, красный лук, зеленый перец чили, кориандр, нарезанные ананасы и манговый чатни";

    public static final String PIZZA_3_TITLE = "Жирная мясная пицца Полякова";
    public static final String PIZZA_3_DESCRIPTION = "Наш рецепт сочетает в себе классические вкусы этого итальянского деликатеса с использованием заменителей на растительной основе";
    public static final String PIZZA_3_RECIPE = "ШАГ 1\n" +
            "Положите муку, дрожжи и сахар в большую миску. Отмерьте 150 мл холодной воды и 150 мл кипятка в кувшин и смешайте их вместе – это будет означать, что температура вашей воды подходит для дрожжей. Добавьте масло и 1 ч. л. соли в теплую воду, затем влейте в муку. Хорошо перемешайте ложкой и начинайте замешивать смесь в миске, пока не получится мягкое и слегка липкое тесто. Если она слишком сухая, добавьте немного холодной воды.\n" +
            "\n" +
            "ШАГ 2\n" +
            "Посыпьте рабочую поверхность небольшим количеством муки и месите тесто в течение 10 минут. Выложите его обратно в миску для замешивания и накройте пищевой пленкой, смазанной несколькими каплями оливкового масла. Оставьте подниматься в теплом месте на 1 час или пока она не увеличится вдвое.\n" +
            "\n" +
            "STEP 3\n" +
            "Разогрейте духовку до 180 ° С / вентилятор / газ 160С 4. Смешайте красный лук с красным винным уксусом и хорошей щепоткой соли и отложите в сторону (уксус слегка размягчит лук, что является благом, поскольку никто не хочет, чтобы пицца была с полностью сырым луком).\n" +
            "\n" +
            "STEP 4\n" +
            "Выложите все ингрдиенты в тарелку, включая сальце и свинячий жир.\n" +
            "\n" +
            "ШАГ 5\n" +
            "Разделите тесто на 2 или 4 части (в зависимости от того, хотите ли вы приготовить большую или маленькую пиццу), сформуйте шарики и расплющите каждый кусочек как можно тоньше скалкой или руками. Убедитесь, что тесто хорошо посыпано мукой, чтобы оно не прилипало. Посыпьте другой противень мукой, затем выложите основу для пиццы – намажьте 4-5 ст. л. томатного соуса, добавьте нарезанные помидоры и тертый веганский сыр. Сбрызните небольшим количеством оливкового масла и запекайте в духовке на предварительно разогретом противне в течение 10-12 минут или до тех пор, пока основа не распухнет, а веганский сыр не начнет пузыриться и покрываться золотистыми вкраплениями.\n" +
            "\n" +
            "ШАГ 6\n" +
            "Повторите с остальным тестом и посыпкой. Подавайте пиццу со свежими листьями базилика или маслом чили, если хотите, и посыпьте пармезаном, налейте свиного жиру и накиньте сальца сразу после выпечки.";

}
